Repository: GlancingMind/surfraw
Catalog: debian/po/*.po
Languages: de, fr

source: New layout for surfraw elvi
de: Neue Anordnung für die elvi von surfraw
fr: Nouvelle organisation pour elvi avec surfraw

source: Surfraw has been rearranged so the elvi (tools to search websites) are in a separate directory (/usr/lib/surfraw) and no longer in your path. To run an elvis now, use:
de: Surfraw wurde rearrangiert so dass die elvi (Werkzeuge um Webseiten zu durchsuchen) in einem seperaten Verzeichnis (/usr/lib/surfraw) und nicht länger in Ihrem Pfad sind. Um jetzt einen elvi zu verwenden, benutzen Sie:
fr: L'organisation du paquet surfraw a été revue afin qu'elvi (l'outil de recherche sur les sites web) soit placé dans un répertoire séparé (/usr/lib/surfraw) au lieu d'être dans le chemin de recherche. Désormais, pour le lancer, vous devez utiliser la commande :

source: surfraw elviname [options] searchterms
de: surfraw elviname [optionen] suchbegriffe
fr: surfraw nom_elvi [options] requête

source: sr is an alias for surfraw, so you could do, for example:
de: sr ist ein Alias für surfraw, d.h. Sie könnten beispielsweise eingeben:
fr: Sr est un alias pour surfraw afin de pouvoir, par exemple, utiliser une commande comme :

source: sr google -lucky my 200 monkeys
de: sr google -lucky mein 200 affen
fr: sr google -lucky mes 200 singes

source: If you wish to retain the old behaviour of running elvi directly, use surfraw-update-path(1) to append /usr/lib/surfraw to your shell's PATH (or optionally, all users and/or all known shells)
de: Falls Sie das alte Verhalten des direkten Ausführens der elvi beibehalten wollen, benutzen Sie surfraw-update-path(1) um Ihren Shell-Pfad um /usr/lib/surfraw zu ergänzen (oder, optional, den aller Nutzer und/oder aller bekannten Shells).
fr: Si vous préférez retrouver l'ancien mode de fonctionnement permettant de lancer elvi directement, utilisez « surfraw-update-path(1) » afin d'ajouter le chemin /usr/lib/surfraw au chemin de recherche pour votre shell (« PATH »). Cette opération peut également être réalisée pour l'ensemble des utilisateurs et des shells du système.

source: Elvi have moved *again*
de: Elvi sind *wieder* verschoben
fr: Elvi a *encore* été déplacé

source: The elvi have moved again to /usr/lib/surfraw
de: Die elvi sind wieder nach /usr/lib/surfraw verschoben
fr: Elvi a encore été déplacé dans /usr/lib/surfraw

source: If you ran surfaw-update-path when version 2.0-1 was installed, you will need to run it again, twice, to update your config files to the new location.
de: Falls Sie surfaw-update-path aufgerufen haben, als Version 2.0-1 installiert war, müssen Sie es erneut aufrufen, zweimal, um Ihre Konfigurationsdateien auf den neuen Ort zu aktualisieren.
fr: Si vous aviez utilisé la commande « surfraw-update-path » lors de l'installation de la version 2.0-1, vous devez l'utiliser à nouveau, deux fois, afin d'adapter vos fichiers de configuration au nouvel emplacement.

source: First run it with -remove, to remove the existing path, then with -add to add the new path.
de: Zuerst rufen Sie es mit -remove auf, um den existierenden Pfad zu entfernen, dann mit -add um den neuen Pfad zu ergänzen.
fr: Utilisez-la d'abord avec l'option -remove pour supprimer le chemin existant, puis avec l'option -add pour ajouter le nouveau chemin d'accès.

source: Remember you will need source your config files (or log out and in again) for this to take effect.
de: Denken Sie daran, daß Sie Ihre Konfigurationsdateien erneut einlesen müssen (oder aus- und dann wieder einloggen müssen) damit diese Änderung in Kraft tritt.
fr: Veillez ensuite à exécuter (« source ») vos fichiers de configuration, ou ouvrez une nouvelle session, pour que ce changement soit effectif.
